soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost/movies"> <soapenv:Header/>
    <soapenv:Body>
        <gs:getMovieRequest>
            <gs:name>Hustlers</gs:name>
        </gs:getMovieRequest>
    </soapenv:Body>
</soapenv:Envelope>
